#brew "fzf"
brew "gh"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "python@3.11"
#brew "ripgrep"
brew "tmux"
brew "tree"
# Brew volta doesn't work well...it's installed in the install.sh script instead
# brew "volta"

cask "discord"
cask "google-chrome"
cask "iterm2"
cask "monitorcontrol"
cask "ollama"
cask "plex"
cask "raycast"
cask "spotify"
cask "visual-studio-code"