if ENV["CODESPACES"] || ENV["GITPOD_WORKSPACE_ID"]
  cask "claude-code"
  brew "stow"

  # Agent-oriented tools (context-efficient for AI coding agents)
  brew "ast-grep"
  brew "difftastic"
  brew "sd"
  brew "scc"
  brew "shellcheck"
  brew "yq"
elsif RUBY_PLATFORM =~ /darwin/
  brew "fzf"
  brew "gh"
  brew "jq"
  brew "lazydocker"
  brew "lazygit"
  brew "neovim"
  brew "podman"
  brew "python@3.11"
  brew "stow"
  brew "tmux"
  brew "tree"
  brew "zoxide"

  # Agent-oriented tools (context-efficient for AI coding agents)
  brew "ast-grep"
  brew "difftastic"
  brew "sd"
  brew "scc"
  brew "shellcheck"
  brew "yq"
  # Brew volta doesn't work well...it's installed in the install.sh script instead
  # brew "volta"
  
  cask "1password"
  cask "claude"
  cask "claude-code"
  cask "cursor"
  cask "discord"
  cask "ghostty"
  cask "google-chrome"
  cask "monitorcontrol"
  cask "plex"
  cask "raycast"
  cask "spotify"
  cask "visual-studio-code"
end